{"title":"Who is the Biggest Pop Star?","dek":"Ranking pop stars, defended by data","intro":[{"type":"text","value":"It used to be easy to rank music — for decades, Billboard’s ranking was based on radio plays or album sales. Today, music consumption has become so fragmented that there’s no single way to measure popularity: we’ve got Spotify, Apple Music, Pandora, Soundcloud, YouTube, radio, album sales, and touring."},{"type":"text","value":"But each of these platforms skews towards a specific audience — imagine a ranking based purely on CD sales. Billboard built a complex equation to deal with this, but a small tweak in sources or weighting would change who the world considers its biggest star. We can’t definitively measure popularity, but we pretend that we can with Billboard’s ranking, which remains our default mental model of culture."},{"type":"text","value":"The Pudding’s team debated this existential musical question and had a few thoughts to consider."}],"definedBy":"Defined by","artistsMust":"All Artists Must","calcTitle":"How The Stars Were Calculated","venueTitle":"Defined by Concert Venue Size","venueBy":"<a href=https://pudding.cool/author/caitlyn-ralph target=_blank>By Caitlyn Ralph</a> & <a href=https://pudding.cool/author/amber-thomas target=_blank>Amber Thomas</a>","venueChartTitle":"Seats booked in 2018","venueIntro":[{"type":"text","value":"An artist’s live shows truly give a sense of their popularity. It’s a physical representation of how many people care about that artist in any given city — care enough to find the tour and a date closest to them, purchase a ticket before their date sells out, and transport themselves to the venue to watch the performance."},{"type":"text","value":"With that said, we saw touring as a key component missing from Billboard’s algorithm. When historians look back on 2018, they should report on those who perform to the largest audiences on the largest tours as the biggest acts in music."}],"venueReq":["have performed one of these iconic venues in 2018: Madison Square Garden in NYC, The Forum in LA, or TD Garden in Boston","have released new music in 2017 or 2018, and are therefore supporting an album cycle"],"venueCalc":["find all concerts played by artist in 2018","measure venue size","sum to find how many seats they played to in 2018"],"gifsTitle":"Defined by Total number of gifs","gifsBy":"<a href=https://pudding.cool/author/jan-diehm target=_blank>By Jan Diehm</a>","gifsIntro":[{"type":"Confession","value":"I’m in my early 30s and I still stan the queen, <a href=https://gph.is/18icB7I target=_blank>Ms. Britney Spears</a>."},{"type":"text","value":"A couple of years ago I made the cross-country pilgrimage to see her perform in Vegas. A little over an hour into singing every <i>single</i> word and dancing my butt off, I had to sit down because I wasn’t getting enough oxygen. My wife promptly quipped: “Even Britney doesn’t sing that much!” (I mean, Brit’s had her fair share of <a href=https://www.youtube.com/watch?v=clwLKJ294u4 taret=_blank>“Me Against the Music”</a> moments, but I still love her.)"},{"type":"text","value":"And that brings us to my argument: pop stars shouldn’t be measured on musical success alone — they’re cultural icons. The biggest ones creep into the zeitgeist and become the things we share and meme. To measure this, I’m using the total number of gifs by artist in <a href=https://giphy.com/ target=_blank>GIPHY’s</a> search results."}],"gifsReq":["have appeared in Billboard’s Top 100 of 2017 or 2018"],"gifsCalc":["find all artists who meet the above criteria","remove any duplicate artists and collaborations","search GIPHY for each artist and record the total number of gifs"],"gifsNotes":[{"type":"text","value":"<strong>P!nk</strong> was removed from the dataset because a search for her name returned too many gifs that were only related to the color pink. Also, shout out to <strong>twenty one pilots</strong> for appearing in two Top 10s so far."}],"chartIntro":[{"type":"text","value":"Billboard’s algorithm is <a href=https://www.billboard.com/articles/news/8427967/billboard-changes-streaming-weighting-hot-100-billboard-200>heavily weighted</a> towards streams by paid accounts, which basically means the ranking is whatever’s played by people with premium accounts on Spotify and Apple Music. Billboard decided that music culture is anyone who can afford to pay $10/month."},{"type":"text","value":"On a global level, this is even more egregious—in many countries, $10/month is a luxury afforded to only the wealthy. It’s also biased towards places where Spotify exists, which excludes India (#2 country in the world, 17% of the world’s population). That’s why the #1 artist on YouTube, Ozuna, had more streams in 2018 (10.7 billion) than Drake, the #1 artist on Spotify (8.2 billion)."}],"chartPost":[{"type":"text","value":"YouTube is a better proxy of popularity. It has global reach, there’s no barrier to entry to listen to music, and there’s no barrier to entry to upload music (i.e., labels still control what’s played on radio)."}],"redditTitle":"Defined by Mentions on Reddit","redditBy":"By Jack Beckwith, Michael Hester, and Sam Vickars of <a href=http://thedataface.com target=_blank>The DataFace</a>","redditIntro":[{"type":"text","value":"These days, artists’ promotional efforts are no longer confined to tours and occasional press runs. They're connecting with fans constantly through social media and building personal brands that extend beyond the music. Younger artists have used this to their advantage, as recent up-and-comers like <a href=https://www.billboard.com/articles/business/8054683/lil-pump-tha-lights-global-warner-bros-influencers target=_blank>Lil Pump</a> and <a href=https://www.theguardian.com/music/2017/sep/29/the-new-american-dream-cardi-bs-rise-from-instagram-to-chart-topping-rapper target=_blank>Cardi B</a> have grown their clout through likes and shares before signing major label deals."},{"type":"text","value":"In this world, artists should be judged on their ability to drive digital conversations. So we’ve turned to Reddit as our data source, counting the number of comments across the platform that mentioned each artist. Yes, Reddit tends to skew fairly young and male. But it’s also one of the <a href=https://www.statista.com/statistics/248074/most-popular-us-social-networking-apps-ranked-by-audience/ target=_blank>largest social networks</a> in the world with an <a href=https://reddit.zendesk.com/hc/en-us/articles/205183225-Audience-and-Demographics target=_blank>impressive global reach</a>."}],"redditReq":["have appeared in Billboard's Top 100 in 2018"],"redditCalc":["compile a list of artists who meet the above criteria along with any nicknames","count total mentions of each artist across all Reddit comments in 2018"],"redditNotes":[{"type":"text","value":"Several artists (like <strong>Future</strong> and <strong>Logic</strong>) were removed from the dataset because their names were too similar to common English phrases."}],"socialTitle":"Defined by Social Followers","socialBy":"<a href=https://pudding.cool/author/ilia_blinderman target=_blank>By Ilia Blinderman</a> & <a href=https://pudding.cool/author/russell-goldenberg target=_blank>Russell Goldenberg</a>","socialIntro":[{"type":"text","value":"Pop is short for popular. And let’s be honest, pop music has never been just about the music — it’s always had some aspect of “how many people are actively paying attention to you?” Luckily for us, we can quantify that by looking, quite literally, at their followers, via social platforms. Introducing your new King of Pop, Justin Bieber."}],"socialPost":[{"type":"text","value":"So, who wins? Should we give the crown to the always-on-tour Dave Matthews Band? Is YoungBoy Never Broke Again’s global reach a true reflection of stardom? Or should we award top spot to 2 Chainz’s meme-ability, Kanye’s ability to garner controversy, or Justin Bieber’s mind-boggling social following?"},{"type":"text","value":"Arguments can be made for any one of these artists, and in some sense, that’s the point: using a data-driven approach to answering a cultural question seems inherently authoritative, but multiple data-driven methods of approaching exist. Which of these is best remains a question for the researchers and the audience to answer together."}]}